#include <iostream>
#include <vector>
#include <map>
using namespace std;

//enum WPrice { доллар = 1, даллсра, долларов };
//enum RPrice { цент = 1, цента = (2,3,4), центов};

map < int, string> mp1{
        {1," доллар "},
        {2," доллара "},
        {3," доллара "},
        {4," доллара "},
        {5," долларов "},
        {6," долларов "},
        {7," долларов "},
        {8," долларов "},
        {9," долларов "},
        {0," долларов "}
};

map <int, string> mp2{
        {1," цент "},
        {2," цента "},
        {3," цента "},
        {4," цента "},
        {5," центов "},
        {6," центов "},
        {7," центов "},
        {8," центов "},
        {9," центов "},
        {0," центов "}

};


template <typename T>
void Res(T price) {

    cout<<"Общая стоимость "<<int(price)<<mp1[ int(price)%10 ]<<( int(price)%10 )<<mp2[ (int(price)%10) ];

}


int main() {
    int y;
    double sum = 0;
    vector<string> vec = {"одноцентовых", "пятицентовых", "десятицентовых", "двадцатицентовых", "пятидесятицентовых"};
    vector<string> vec1 = {"одноцентовая", "пятицентовая", "десятицентовая", "двадцатицентовая", "пятидесятицентовая"};
    vector<double> cen = {0.01, 0.05, 0.1, 0.2, 0.5};

    for (int i = 0; i < vec.size(); ++i) {
        cout << "\nСколько у вас " << vec[i] << " монет?";
        cin >> y;
        if (y == 1) {
            cout << "У вас " << y <<" "<< vec1[i] << " монета";
            sum += (cen[i] * y);
        }
        else if (y == 2 || y == 3 || y == 4) {
            cout << "У вас " << y <<" "<< vec[i] << " монеты";
            sum += (cen[i] * y);
        }
        else {
            cout << "У вас " << y << " " << vec[i] << " монет";
            sum += (cen[i] * y);
        }
    }
    cout<<endl;
    Res(sum);
    return 0;

}